AG_2019/OSB/AlmacenesGarcia_DEV/Applications/JDA/APIMicroservice/Resources/JDAAPIMSWrapperWSDL.wsdl

<!-- Published by JAX-WS RI (http://jax-ws.java.net). RI's version is JAX-WS RI 2.2.11-b150616.1732 svn-revision#a247ba216861f2c0baac9a3657c5690bce0c744d. --><!-- Generated by JAX-WS RI (http://jax-ws.java.net). RI's version is JAX-WS RI 2.2.11-b150616.1732 svn-revision#a247ba216861f2c0baac9a3657c5690bce0c744d. --><definitions targetNamespace="http://mediation.core.jda.ea.agarcia.mx/" name="ConnectSvc" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wsp="http://www.w3.org/ns/ws-policy" xmlns:wsp1_2="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://mediation.core.jda.ea.agarcia.mx/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://schemas.xmlsoap.org/wsdl/">
<types>
<xsd:schema>
<xsd:import namespace="http://mediation.core.jda.ea.agarcia.mx/" schemaLocation="../Schema/JDAAPIMSWrapperSchema.xsd"/>
</xsd:schema>
</types>
<message name="process">
<part name="parameters" element="tns:process"/>
</message>
<message name="processResponse">
<part name="parameters" element="tns:processResponse"/>
</message>
<message name="APIException">
<part name="fault" element="tns:APIException"/>
</message>
<portType name="ConnectProxy">
<operation name="process">
<input wsam:Action="http://mediation.core.jda.ea.agarcia.mx/ConnectProxy/processRequest" message="tns:process"/>
<output wsam:Action="http://mediation.core.jda.ea.agarcia.mx/ConnectProxy/processResponse" message="tns:processResponse"/>
<fault message="tns:APIException" name="APIException" wsam:Action="http://mediation.core.jda.ea.agarcia.mx/ConnectProxy/process/Fault/APIException"/>
</operation>
</portType>
<binding name="ConnectPortBinding" type="tns:ConnectProxy">
<soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="document"/>
<operation name="process">
<soap:operation soapAction=""/>
<input>
<soap:body use="literal"/>
</input>
<output>
<soap:body use="literal"/>
</output>
<fault name="APIException">
<soap:fault name="APIException" use="literal"/>
</fault>
</operation>
</binding>
<service name="ConnectSvc">
<port name="ConnectPort" binding="tns:ConnectPortBinding">
<soap:address location="http://192.1.50.179:7009/ConnectProxyImpl/ConnectSvc"/>
</port>
</service>
</definitions>