AG_2019/Java/Microservicio/García/JDAAPIApp/JDAAPICore/src/META-INF/config/SamplePayload.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:med="http://mediation.core.jda.ea.agarcia.mx/">
   <soapenv:Header/>
   <soapenv:Body>
      <med:process>
         <request>
            <header>
               <destiny>JDA</destiny>
               <interfaceId>SupplierQuery</interfaceId>
               <parameters>
                  <entry>
                     <key>queryId</key>
                     <value>supplier.findById</value>
                  </entry>
               </parameters>
               <source>LOCALTEST</source>
            </header>
            <payload>PFN1cHBsaWVycz4KPFN1cHBsaWVyPgo8SWQ+MTAyMjwvSWQ+CjwvU3VwcGxpZXI+CjwvU3VwcGxp
ZXJzPg==</payload>
         </request>
      </med:process>
   </soapenv:Body>
</soapenv:Envelope>